<html>


   <head>
      
      <script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
      
      <title> Funktionen h&ouml;herer Ordnung komponieren, um
      kompliziertere Probleme zu l&ouml;sen.</title>
      
   </head>   
      

   <body>

<p><br>
  Stell Dir vor, wir wollen alle Elemente einer Liste quadrieren. Das
  ist ein typisches <code>map</code> Problem:<br>
<img border="0" title="map (() * ()) over list" alt="map (() * ()) over list" src="/bjc-r/img/list/hof/mapsq.png"/>

<br><br>
Aber jetzt stell Dir vor, wir wollen die ungeraten Zahlen aus der
Liste ausw&auml;hlen. Es ist etwas schwierig, herauszufinden, ob eine Zahl
gerade oder ungerade ist, aber abgesehen davon, ist es ein
typisches <code>keep</code> Problem:<br>

<img border="0" title="keep items such that <(() mod (2)) = (1)> from list..." alt="keep items such that <(() mod (2)) = (1)> from list..." src="/bjc-r/img/list/hof/keepodds.png"/>

<br><br>
Aber was passiert, wenn wir die ungeraden Zahlen quadrieren wollen?
Das ist weder ein einfaches <code>map</code> Problem, noch ein
einfaches <code>keep</code> Problem, sondern verbindet Aspekte von
beiden. Und wir l&ouml;sen die Aufgabe, indem wir den von <code>keep</code>
zur&uuml;ckgegebenen Wert als Eingabe f&uuml;r <code>map</code> verwenden:<br>
<img border="0" title="map square over keep odds from list" alt="map square over keep odds from list" src="/bjc-r/img/list/hof/sq-odds.png"/>

<br>
Sei nicht verwirrt davon, welche Eingaben Ringe haben  und welche
nicht. Wir verwenden die <code>square</code>-<u>Funktion</u> und die
<code>are-you-odd?</code>-<u>Funktion</u>, die wir als die erste
Eingabe f&uuml;r jede Funktion h&ouml;herer Ordnung verwenden. Aber
obwohl <code>keep</code> ist eine Funktion, verwenden wir die
von <code>keep</code> zur&uuml;ckgegebene Liste als die zweite Eingabe
zu <code>map</code>.

</p><br>Wir arbeiten auf eine der gro&szlig;en, sch&ouml;nen Abl&auml;ufe hin, die Du
in diesem Kurs sehen wirst: Wir wollen eine Phrase nehmen, etwa
&quot;Beauty and Joy of Computing,&quot; und sein Akronym ausgeben,
BJC. Du hast bereits zwei Teile der L&ouml;sung kennengelernt:
<br>   - W&auml;hle nur W&ouml;rter mit f&uuml;nf oder mehr Buchstaben.<br> - Mache
eine Liste der ersten Buchstaben der W&ouml;rter. 
<br>Schau noch einmal nach, wie das geht, wenn Du Dich nicht mehr erinnerst.

<p>Aber es gibt zwei weitere Schritte, einer am Anfang der Aufgabe und
  einer am Ende, die beide damit zu tun haben, dass Leute (die
  Benutzer Deines Programms) W&ouml;rter und Phrasen in der Form von
  Text-Strings sehen wollen, aber - wie Du gesehen hast - ist es viel
  einfacher, Funktionen dieser W&ouml;rter und S&auml;tze zu berechnen, wenn sie
  als Listen vorliegen, damit wir die Funktionen h&ouml;herer Ordnung
  verwenden k&ouml;nnen, die Du gerade lernst. 

</p>
Um einen Text-String in eine Liste W&ouml;rterliste zu
&Uuml;bersetzen, liefert <span class="snap">snap</span>  den
Reporter <code>sentence-&gt;list</code> (sprich &quot;sentence to
list&quot;), der einen Text-String als Eingabe nimmt und eine
W&ouml;rterliste ausgibt::<br>
<img border="0" src="/bjc-r/img/list/hof/stol-bjc.png" alt="sentence->list block" title="sentence->list block"/>
<br>Wie &uuml;blich siehst Du nur die ersten drei Elemente einer Liste in
Sprach-Ballon, aber Dir wird am Ende der Phrase gesagt, dass die Liste
5 lang ist, wie es sein sollte f&uuml;r die f&uuml;nf W&ouml;rter in einer Phrase.

<p>Wenn wir die Liste haben, k&ouml;nnen wir die bereits angefertigten
  Werkzeuge verwenden, um eine Liste der ersten Buchstaben der langen
  W&ouml;rter zu erzeugen. Was wir jedoch wollen, ist ein einzelnes Wort
  als Ausgabe. Wir k&ouml;nnen eine der Funktionen h&ouml;herer Ordnung
  verwenden, um die Buchstaben zu einem String zusammenzuziehen.

</p><b>Versuche das: </b>Sollten wir <code>map</code>,
oder <code>keep</code>, oder <code>combine</code> daf&uuml;r verwenden?

<p>Hier ist das Ergebnis:<br>
<img border="0" src="/bjc-r/img/list/hof/acronym.png" alt="acronym definition" title="acronym definition" /><br>
<img border="0" src="/bjc-r/img/list/hof/bad-bjc.png" alt="acronym reports BC instead of BJC" title="acronym reports BC instead of BJC"/>
<br>Oh! Das Wort &quot;Joy&quot; ist k&uuml;rzer als f&uuml;nf Buchstaben, aber
es ist trotzdem ein wichtiges Wort im Akronym. Wir brauchen einen
besseren Algorithmus.

</p><br><br><b>Versuche dies: <br></b>
Modifizieren den <code>acronym</code> Block so dass er anstatt lange
W&ouml;rter zu behalten, W&ouml;rter beh&auml;lt, die mit Gro&szlig;buchstaben
anfangen. (Hinweis: Experimentiere mit dem <code>unicode of</code> Block.)<br>
<img border="0" src="/bjc-r/img/list/hof/good-bjc.png" alt="acronym reports BJC" title="acronym reports BJC"/><p>
<img border="0" src="/bjc-r/img/list/hof/ucb-acro.png" alt="acronym of UCB" title="acronym of UCB"/></p>
<img border="0" src="/bjc-r/img/list/hof/byob-acro.png" alt="BYOB" title="BYOB"/><br><br>  

   </body>
</html>
