<html>
    <head>
        <script type="text/javascript" src="/bjc-r/llab/loader.js"></script>

        <title>Einleitung: Wozu brauchen wir Konditional-Ausdr&uuml;cke??</title>
    </head>
    <body>
      <p class="code-vid">
        <iframe width="560" height="315" src="//www.youtube.com/embed/fVUL-vzrIcM" frameborder="0" allowfullscreen></iframe>
        <br />
        Danke an <a href="http://code.org">code.org</a> f&uuml;r dieses Video!
      </p>
	<p>
	Bisher hast Du ge&uuml;bt, Skripte zu schreiben, die kurze Befehlsfolgen ausf&uuml;hren. Diesen Skripten ist allen gemein, dass sie jeden ihrer Bl&ouml;cke ausf&uuml;hren, egal was. Aber was ist, wenn wir ein komplexeres Programm schreiben m&ouml;chten?
	Wollen wir immer jeden Teil unseres Programms ausf&uuml;hren? Hier ein Beispiel:
	</p>

	<ul>
	    <li>
	    	Schreibe eine einfaches Banking-Programm, mit dem der Nutzer Geld abheben und einzahlen sowie den Kontostand
	    	anzeigen lassen kann. Nach dem Start wird der Nutzer gefragt, was er tun m&ouml;chte. Wenn er aus- oder einzahlen
	    	w&auml;hlt, soll er nach der Menge gefragt werden, um die der Kontostand danach erh&ouml;ht oder erniedrigt wird.
	    	Wenn er nach seinem Kontostand fragt, muss dieser nur einfach ausgegeben werden.
	    </li>
	</ul>

	<p>
	    &Uuml;berlege mit einem Partner, wie man ein solches Programm schreiben k&ouml;nnte. Denkt insbesondere &uuml;ber die
	    kleinen Teile nach, die zusammen das gesamte Programm ergeben.
	</p>

	<p>
	    Nun, da du &uuml;ber das Beispiel nachgedacht hast, lasst uns die ben&ouml;tigten Teile durchgehen.
	    Im Banking-Beispiel wirst du Code f&uuml;r Nutzereingaben, Abheben, Einzahlen und die Kontostandsanzeige schreiben m&uuml;ssen.
	    Um auf die vorher erw&auml;hnte Frage zur&uuml;ckzukommen, m&ouml;chten wir <i>immer</i> den ganzen Code ausf&uuml;hren?
	    Die Antwort ist "Nein". Wenn der Nutzen zum Beispiel ausw&auml;hlt, den Kontostand anzuzeigen, m&ouml;chten wir ganz sicher nichts
	    abheben. Diese Idee kann in der Form von Bedingungen oder auch "if-then" (Wenn-Dann)-Aussagen.
	    Das Banking-Beispiel kann so ausgedr&uuml;ckt werden:
	</p>

	<ul>
	    <li>
		Frag den Nutzer, was er tun m&ouml;chte.
	    </li>
	    <li>
		<strong>Wenn (If)</strong> der Nutzen "abheben" ausw&auml;hlt, <strong>dann (then)</strong> frag wie viel und zieh diesen Betrag vom Kontostand ab.
	    </li>
	    <li>
		<strong>Wenn (If)</strong> der Nutzer "einzahlen" ausw&auml;hlt, <strong>dann (then)</strong> frag wie viel und erh&ouml;he den Kontostand um diesen Betrag.
	    </li>
	    <li>
		<strong>Wenn (If)</strong> der Nutzen "Kontostand anzeigen" ausw&auml;hlt, <strong>dann (then)</strong> zeig den Kontostand an.
	    </li>
	</ul>
	<p>
	Merke dir, dass die letzten drei Punkte all das Format "wenn <strong>A</strong>, dann <strong>B</strong>" haben, <strong>A</strong> und <strong>B</strong> jeweils Ausdr&uuml;cke sind. F&auml;llt dir etwas besonderes auf? Alle <strong>A</strong>-Ausdr&uuml;cke (zwischen "wenn" und "dann" kannst du dir als Ja/Nein-Fragen vorstellen. "Wenn der Nutzer 'abheben' ausw&auml;hlt" kannst du dir wie "Hat der Nutzer 'abheben' ausgew&auml;hlt?" vorstellen, die Antwort kann nur "Ja" oder "Nein" sein. Die <strong>B</strong>-Ausdr&uuml;cke sagen dem Programm dann, was zu tun ist.
	</p>

	<p>
	    Zum Gl&uuml;ck &auml;hneln die Bl&ouml;cke in <span class="snap">snap</span>, die "wenn-dann"-Ausdr&uuml;cke m&ouml;glich machen, sehr den englischen Begriffen daf&uuml;r. Unten ist ein Beispiel, wie das Banking-Programm aussehen k&ouml;nnte. Lies es laut vor. Es klingt fast wie ein korrekter englischer Text. Aber mach dir keine Sorgen, wenn du etwas nicht verstehst, gleich kl&auml;ren wir alles.
	</p>

	<img src="/bjc-r/img/cond/banking-demo.png" alt="an example banking program"/>

	<!-- sufficient funds here too? -->

    </body>
</html>
