<!DOCTYPE html>
<html>
		<!-- put the following in exactly --><script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
		
		<title>Ziegelwand</title>
	<body style="margin-top: 60px;"><div class="full"><div class="header">Brick Wall</div>

		<p>
                  Manchmal scheint es beim Programmieren, als ob wir
                  gegen eine Wand laufen. (Das ist ein gutes Zeichen;
                  wenn ein Projekt nicht schwierig ist, forderst Du
                  Dich nicht genug!) Jetzt werden wir diese Wand malen:
		</p>
		<p>
			<span style="margin-left: 40px;"><img border="0" title="Sample image of brick wall" alt="Sample image of brick wall" src="/bjc-r/img/abstraction/new-brickwall/wall.png"></span>
		</p>
		<h2>Abstraktion</h2>
		<p>Obwohl <span class="snap">snap</span>  viele
		Bl&ouml;cke f&uuml;r Malen und Bewegen hast, gibt es
		nichts zu Ziegeln. Es w&uuml;rde keinen Sinn machen,
		von vorne herein einen Ziegel bereitzustellen, da die
		meisten Programme keinen brauchen. Aber diejenigen
		welche, br&auml;chten wirklich
		einen <img src="/bjc-r/img/abstraction/new-brickwall/draw-brick.png"
		alt="draw-brick">
		Block. <img src="/bjc-r/img/abstraction/new-brickwall/draw-brick.png"
		\="" }="" alt="draw-brick"> bringt uns weg von den
		Kategorien des Computers und n&auml;her ran an die
		Kategorien des Problems, das wir zu l&ouml;sen
		versuchen. Die &Uuml;bersetzung von einer
		Programmiersprache in eine nat&uuml;rliche Srache
		(eine in der Menschen kommunizieren) ist
		unerl&auml;sslich f&uuml;r gute
		Abstraktion.
	       </p>
		<p>In dieser Aufgabe baust Du eine Abstraktion, um
		eine Ziegelwand zu malen, indem Du
		zuerst <img src="/bjc-r/img/abstraction/new-brickwall/draw-brick.png"
		alt="draw-brick"> erzeugst, dann Bl&ouml;cke um
		Zeilen zu malen, und schlie&szlig;lich das Ziel: <img src="/bjc-r/img/abstraction/new-brickwall/draw-brick-wall-num.png" alt="draw-brick-wall-n">.
		</p>
		<p>
			&nbsp;
		</p>

<h2>Einen Ziegel malen</h2>

<p>Ein Ziegel ist ein rotes Rechteck ("Ziegelrot", d. h. kein
  Prim&auml;rfarben-Rot, sondern etwas dunkler). Es gibt keinen "Mal
  Rechteck" Block in <span class="snap">snap</span> , aber wir
  k&ouml;nnen so tun als ob, indem wir uns ein Rechteck als sehr dicke
  Linie vorstellen. Du wei&szlig;t, wie man mit dem <b>move</b> Block
  eine Linie malt. In der <b>Pen</b> Palette gibt es einen <b>set pen
  size</b> Block. Wir k&ouml;nnen ihn verwenden, um eine dicke Linie
  zu malen:</p>

<span style="margin-left: 40px;"><img border="0" title="code for brick" alt="Code for draw brick" src="/bjc-r/img/abstraction/new-brickwall/draw-brick-code.png"></span>

<p>Wenn Du diesen Block ausprobierst, wirst Du merken, dass Dein
  Ziegel abgerundete Ecken hat. Diese Enden ragen &uuml;ber das Ende
  der Linie raus, die Du malen wolltest. Hier ist ein Bild eines
  abgerundeten Ziegels mit einer normalen Linie (Pen Size 1) drin:</p>

<span style="margin-left: 40px;"><img border="0" title="round brick" alt="Round brick" src="/bjc-r/img/abstraction/new-brickwall/round-brick.png"></span>

<p>Diese abgerundeten Enden sind meistens sehr h&uuml;bsch, aber sie
  sehen nicht wie Ziegelsteine aus, und sie verkomplizieren das
  Nachdenken &uuml;ber L&auml;ngen in diesem Projekt. F&uuml;r dieses
  Projekt schalten wir daher die abgerundeten Enden ab. Klicke auf
  den <em>settings</em> Knopf
(<img src="/bjc-r/img/abstraction/new-brickwall/settings.png"
  alt="settings button">) im Toolbar, und schalte die Option "<b>Flat line
ends</b>" an.

		</p><h2>Problemzerlegung verwenden, um eine
		Abstraktion zu schreiben</h2>
		<p>
			Betrachte diese Code-Zeile, die verwendet wurde,
		die Zielgelwand zu bauen:
		</p>
		<p><img src="/bjc-r/img/abstraction/new-brickwall/draw-brick-wall-7.png" alt="draw-brick-wall-7">
		</p>
		<p>
Wenn Du einen Maurer bittest, eine Ziegelwand mit sieben Zeilen zu
machen, versteht er Dich sicher und f&uuml;hrt sie auf. Ein Computer
versteht allerdings nicht, was das bedeutet, und Du musst mehr Details
liefern. Das bedeutet, vom Abstrakten (mal eine Ziegelwand) zum
Konkreten zu gehen. Daf&uuml;r braucht man Problemzerlegung.
		</p>
		<p>
                  Eine kleine &Uuml;berlegung zeigt, dass es zwei
			Arten von Ziegelzeilen gibt:
		</p>
		<ul>
			<li>
				<strong>Row A</strong>: <img border="0" title="Row A" alt="Row A" src="/bjc-r/img/abstraction/new-brickwall/row-a.png">
			</li>
			<li>
				<strong>Row B</strong>: <img border="0" title="Row B" alt="Row B" src="/bjc-r/img/abstraction/new-brickwall/row-b.png">
			</li>
		</ul>

<p>Mache
  Bl&ouml;cke <img src="/bjc-r/img/abstraction/new-brickwall/rowa-block.png"
                   alt="Row A">
  und <img src="/bjc-r/img/abstraction/new-brickwall/rowb-block.png"
           alt="Row B">.  &Uuml;berlege, welche Hilfs-Bl&ouml;cke
  au&szlig;er <img src="/bjc-r/img/abstraction/new-brickwall/draw-brick.png"
  alt="Draw Brick"> Du vielleicht brauchst.</p>

<p>Es ist m&ouml;glich, es mit der Abstraktion zu &uuml;bertreiben, so
  dass Du unendlich viele Bl&ouml;cke hast und es schwierig ist
  herauszufinden, wo die eigentliche Arbeit erledigt
  wird. Andererseits ist es manchmal sogar dann n&uuml;tzlich, einen Spezialblock
  zu verwenden, wenn seine Definition nur aus einem primitiven Block
  besteht. Um zum Beispiel den <i>M&ouml;rtel</i> zwischen den Ziegeln
  einer Reihe zu malen, brauchst Du nur (da
  der <img src="/bjc-r/img/abstraction/new-brickwall/draw-brick.png"
  alt="Draw Brick"> Block den Stift am Ende des Scripts anhebt)
  vorw&auml;rts zu gehen:</p>

<img src="/bjc-r/img/abstraction/new-brickwall/move4.png" alt="Move 4 Steps">

<p>Du k&ouml;nntest diesen <b>move</b> Block einfach in
  Deinem <b>Zeile A</b> Block verwenden. Aber vielleicht m&ouml;chtest
  Du statt dessen einen <b>Mal M&ouml;rtel</b> Block verwenden. Warum?
  Vielleicht entscheidest Du Dich, dass vier Schritte die falsche
  Dicke f&uuml;r M&ouml;rtel ist, und Du lieber f&uuml;nf Schritte
  h&auml;ttest. Wenn in Deinem Programm ein Dutzend <b>Move</b>
  Bl&ouml;cke verstreut sind, um M&ouml;rtel zu malen, findest Du sie
  vielleicht nicht alle. Mit einem <b>Mal M&ouml;rtel</b> Block kannst
  Du einfach seine Definition &auml;ndern und der M&ouml;rtel wird
  &uuml;berall ver&auml;ndert.

</p><p>Bemerke dass die beiden Arten von Reihen genau die gleiche
              L&auml;nge haben sollten. Warum? Reihe A hat sechs ganze
              Ziegel. Reihe B hat f&uml;nf ganze Zielgel und zwei
              halbe Ziegel, was sich zu sechs Ziegeln summiert. Um den
              Fehler zu verstehen, betrachte den <i>M&ouml;rtel</i> in
              jeder Art von Zeile.</p>

<p>Wie wirst Du das beheben? Sollte eine Reihe B Ziegel von anderer
  Gr&ouml;&szlig;e haben, M&ouml;rtel-L&uuml;cken von anderer
  Gr&ouml;&szlig;e, oder Halbziegel von anderer Gr&ouml;&szlig;e? Wenn
  Du nicht sicher bist, probiere alle M&ouml;glichkeiten aus und schau
  nach, welche in der fertigen Wand richtig aussieht. (Es gibt nur
  eine wirklich gute Antwort.)</p>

<p>Wenn Du die beiden Reihen von der gleichen L&auml;nge hast, kannst
  Du den 
<img src="/bjc-r/img/abstraction/new-brickwall/draw-brick-wall-num.png" alt="Draw a Brick Wall with ( ) Rows">
Block schreiben.  Er sollte m&ouml;glichst f&uuml;r eine gerade und
eine ungerade Anzahl von Ziegeln funktionieren; das bedeutet, Du muss
manchmal eine extra Zeile A malen.</p>

<p>(Woher wei&szlig;t Du, ob eine Zahl gerade ist? Du wirst den 
<img src="/bjc-r/img/blocks/mod.png" alt="Mod">
Block hilfreich finden.)</p>

<h2>Zus&auml;tzliche &Uuml;bungen</h2>

<p>Nachdem Du das Bild oben auf dieser Seite gemalt hast, f&uuml;ge
  dem <b>Draw a Brick Wall</b> Block neue Inputs hinzu:</p>

<ul><li>L&auml;nge der Wand (wie viele Ziegel)</li>
<li>L&auml;nge eines Ziegels</li>
<li>M&ouml;rteldicke</li></ul>

<p>F&uuml;ge dieses eins nach dem anderen hinzu, nicht alle auf
  einmal! Wenn Du die L&auml;nge eines Ziegels ver&auml;nderst, sollte
  sich auch die L&auml;nge des Halbziegels &auml;ndern. Wenn Du die
  M&ouml;rteldicke &auml;nderst, sollte das auch den Abstand zwischen
  den Reihen &auml;ndern (da das auch M&ouml;rtel ist).</p>

	

</div></body></html>
