<!DOCTYPE html>
<html><head><!-- put the following in exactly --><script type="text/javascript" src="/bjc-r/llab/loader.js"></script><title>A New Structure: "Hash Tables"</title><!--ORIGINAL NAME: Storing Data for Searching--></head><body><div>Das heutige Ziel ist es, eine einfache Suchmaschine zu bauen, die W&ouml;rter in einer Liste von Zitaten finden kann.
Wir werden unsere Suchmaschine so &auml;hnlich aufbauen wie Google (das besprechen wir sp&auml;ter noch ausf&uuml;hrlicher).
Wie du dir bestimmt denken kannst, haben Suchmaschinen die Anforderung, Dinge <i>schnell</i> zu finden, aber die bisher gelernten Techniken geben uns nicht die M&ouml;glichkeit hazu. Wir brauchen etwas schnelles, etwas <i>blitzschnelles</i>. <br></div>

<div style="float: right;"><img border="0" src="/bjc-r/img/prog/hash-comparison.png" alt="Hash Comparison" title="Hash Comparison" origsrc="http://veritas.eecs.berkeley.edu/courses/file.php/17/hash-comparison.png"></div> <span style="font-weight: bold;">Hinweis: </span>das Wort <span style="font-style: italic;">Index</span> hat unten verwendet eine andere Bedeutung als der Suchmaschinen-Index, der im Rest dieses Kapitels benutzt wird.<br><br>
Wie du wei&szlig;t, erlauben einem Listen, mehrere St&uuml;cke Daten in einer Variable aufzubewahren. Du kannst sie schnell wieder aufrufen, indem du den <span style="font-style: italic;">Index</span> der Daten, die du finden m&ouml;chtest, angibst. Der Index ist die Nummer in einer Liste. Es gibt eine sehr &auml;hnliche Datenstruktur, die <span style="font-style: italic;">Hashtabelle</span> genannt wird, die sehr &auml;hnlich funktioniert, aber stattdessen auch ein Wort oder eine Phrase als Index erlaubt. Du kannst den Unterschied im Bild auf der rechten Seite sehen.
Statt einer Nummer wird der Name der Person als Index verwendet.<br><br>
Dies ist eine unglaublich m&auml;chtige Art und Weise, Daten aufzubewahren, die sich auf andere Daten beziehen. Zum Beispiel k&ouml;nnte man ein Telefonbuch mit einer Hashtabelle implementieren, die den Namen der Person als <span style="font-style: italic;">Index</span> und die Telefonnummer als Daten verwendet.
Wenn du sp&auml;ter die Nummer von jemandem herausfinden m&ouml;chtest, gibst du einfach den Namen an und nimmst die damit verbundene Telefonnummer aus der Hashtabelle.
Dieser Kurs stellt dir drei sehr schnelle Bl&ouml;cke zur Verf&uuml;gung, um mit Hashtabellen zu arbeiten.<br><br>
<img border="0" src="/bjc-r/img/prog/hash-convert.png" alt="Convert to hash table" title="Convert to hash table" origsrc="http://veritas.eecs.berkeley.edu/courses/file.php/17/hash-convert.png">
Der erste Block erlaubt es dir, eine Liste in eine Hashtabelle umzuwandeln. Der erste Parameter ist eine leere Liste und der zweite die Gr&ouml;&szlig;e der Hashtabelle (die Anzahl der Elemente, die hinein passen sollen). Wenn dieser Block ausgef&uuml;hrt wurde, ist die &uuml;bergebene Liste eine Hashtabelle!<br><br>
<div style="margin-left: 40px;"><span style="font-weight: bold;">Hinweis:</span> Es ist in der Regel besser ungef&auml;hr doppelt so viel Platz in der Hashtabelle zu haben, als du wirklich br&auml;uchtest. Auch, aus technischen Gr&uuml;nden, funktionieren Hashtabellen am besten, wenn ihre Gr&ouml;&szlig;e eine Primzahl ist. Du kannst sie entweder zu einer <a href="http://primes.utm.edu/lists/small/1000.txt">verh&auml;ltnism&auml;&szlig;ig gro&szlig;en Zahl setzer</a> oder einen anderen Weg benutzen, der dir einf&auml;llt. Die Primzahl sollte zu der Menge von Daten passen, die aufbewahrt werden soll -- 53 mag f&uuml;r kleinere Datens&auml;tze gen&uuml;gen, gr&ouml;&szlig;ere Projekte (so wie das letzte Projekt dieses Kapitels) sollten eher eine Gr&ouml;&szlig;e von 521 haben.<br></div><br>
<img border="0" src="/bjc-r/img/prog/hash-add.png" alt="Add to table" title="Add to table" origsrc="http://veritas.eecs.berkeley.edu/courses/file.php/17/hash-add.png">
Dieser Block erlaubt dir, neue Daten in die Hashtabelle einzutragen. Der erste Parameter gibt dem Eintrag einen Namen, wie zum Beispiel "Max Mustermann" in einem Telefonbuch. Der zweite Parameter ist die mit dem ersten Block generierte Hashtabelle. Der dritte Parameter ist der Wert (eine Nummer, Phrase, Liste, was auch immer), auf den sich "Max Mustermann" bezieht. Dieser Block wird die angegebene Information in die Hashtabelle eintragen, sodass sie sp&auml;ter wieder aufgerufen werden kann.<br><br>
<img border="0" src="/bjc-r/img/prog/hash-get.png" alt="Get from table" title="Get from table" origsrc="http://veritas.eecs.berkeley.edu/courses/file.php/17/hash-get.png"> Nachdem du die Information eingetragen hast, wird dieser Block sie dir wieder schnell herausholen. Er gibt den Wert (z.B. die Telefonnummer) f&uuml;r den Schl&uuml;ssel (z.B. "Max Mustermann"), den du angibst. Du musst auch die mit dem ersten Block generierte Hashtabelle angeben.<br><br><div style="clear: both;"></div>
<h2>[Optional] Information f&uuml;r die Neugierigen</h2>
<div style="float: right;"><img border="0" src="/bjc-r/img/prog/hash-numbers-example.png" alt="How a Hash Table Works" title="How a Hash Table Works" origsrc="http://veritas.eecs.berkeley.edu/courses/file.php/17/hash-how.png"></div>
<p>Hashtabellen sind ein gro&szlig;artiges Werkzeug aus der Kiste der Programmierer. Hashtabellen nutzen zwei regul&auml;re Listen: eine, um die Index-Daten zu speichern, oder auch <span style="font-style: italic;">Schl&uuml;ssel</span> genannt, und die andere um die Daten zu speichern, oder auch <span style="font-style: italic;">Werte</span> genannt. Jeder Schl&uuml;ssel ist mit dem dazugeh&ouml;rigen Wert gepaart und an gleicher Stelle in den beiden Listen (siehe die rot hervorgehobene Stelle im Bild).<br></p>
<p>Wenn jemand Kleopatras Telefonnummer erfahren m&ouml;chte, ist es m&ouml;glich, durch die Liste mit Schl&uuml;sseln zu gehen bin ein Schl&uuml;ssel mit dem gleichen Namen gefunden wurde und an der entsprechenden Stelle in der Liste mit den Werten nachzuschauen. Wenn Kleopatras Name als viertes in der Liste steht, steht ihre Telefonnummer auch an vierter Stelle in der anderen Liste. In Wirklichkeit ist es nicht n&ouml;tig, die Liste der Reihenfolge nach durchzugehen; es gibt ein spezielles Verfahren namens <span style="font-style: italic;">Hashing </span>(daher auch der Name 'Hashtabellen'), das es m&ouml;glich macht, Elemente viel schneller zu finden.<span style="font-style: italic;"></span> Wir werden hier nicht ins Detail gehen, aber eine Mischung aus Hashing und dem Verfahren mit den beiden Listen ist es, was Hashtabellen so m&auml;chtig macht.</p>
<p>Wenn du mehr erfahren m&ouml;chtest, <a href="http://en.wikipedia.org/wiki/Hash_table" title="Hash tables">hier ist der Wikipediaartikel &uuml;ber Hashtabellen</a>.<br></p>   </body></html>
